<template>
  <q-layout view="lHh lpR lfr" class="main-layout">
    <q-header elevated class="bg-white">
      <q-toolbar></q-toolbar>
      <q-list class="q-header-info">
        <q-item>
          <q-btn-dropdown
            color="dark"
            flat
            dropdown-icon="keyboard_arrow_down"
            class="q-header-info__dropdawn"
            content-class="q-header-info__dropdawn__inside"
            size="16px"
          >
            <template #label>
              <q-icon class="telegram" left size="24px">
                <svg width="24" height="24" viewBox="0 0 24 24">
                  <path
                    d="M11.9997 12.4399C15.1536 12.4399 17.7197 9.87386 17.7197 6.71996C17.7197 3.56606 15.1536 1 11.9997 1C8.84585 1 6.27979 3.56606 6.27979 6.71996C6.27979 9.87386 8.84585 12.4399 11.9997 12.4399Z"
                  />
                  <path
                    d="M18.8573 12.2024C18.6747 12.0559 18.4085 12.0783 18.2532 12.2543C16.663 14.0499 14.3834 15.08 11.9999 15.08C9.61647 15.08 7.33684 14.0499 5.74625 12.2543C5.59093 12.0787 5.32517 12.0554 5.14213 12.2024C2.51007 14.3042 1 17.4379 1 20.7999V22.5599C1 22.8032 1.19712 22.9999 1.44 22.9999H22.5599C22.8032 22.9999 22.9999 22.8032 22.9999 22.5599V20.7999C22.9999 17.4383 21.4898 14.3047 18.8573 12.2024Z"
                  />
                </svg>
              </q-icon>
              <span class="block">{{ $auth.user().email }}</span>
            </template>
            <q-list>
              <q-item class="q-header-info__dropdawn-user">
                <q-icon size="16px">
                  <svg width="16" height="16" viewBox="0 0 24 24">
                    <path
                      d="M11.9997 12.4399C15.1536 12.4399 17.7197 9.87386 17.7197 6.71996C17.7197 3.56606 15.1536 1 11.9997 1C8.84585 1 6.27979 3.56606 6.27979 6.71996C6.27979 9.87386 8.84585 12.4399 11.9997 12.4399Z"
                    />
                    <path
                      d="M18.8573 12.2024C18.6747 12.0559 18.4085 12.0783 18.2532 12.2543C16.663 14.0499 14.3834 15.08 11.9999 15.08C9.61647 15.08 7.33684 14.0499 5.74625 12.2543C5.59093 12.0787 5.32517 12.0554 5.14213 12.2024C2.51007 14.3042 1 17.4379 1 20.7999V22.5599C1 22.8032 1.19712 22.9999 1.44 22.9999H22.5599C22.8032 22.9999 22.9999 22.8032 22.9999 22.5599V20.7999C22.9999 17.4383 21.4898 14.3047 18.8573 12.2024Z"
                    />
                  </svg>
                </q-icon>
                <q-item-label>{{ $auth.user().email }}</q-item-label>
              </q-item>

              <q-item clickable to="/lk/profile">
                <q-icon size="16px">
                  <svg width="16" height="16" viewBox="0 0 16 16">
                    <path
                      d="M14.7693 6.30768H13.3782C13.2789 5.9932 13.1523 5.68773 12.9988 5.3944L13.9829 4.41004C14.2032 4.18976 14.2032 3.83268 13.9829 3.6124L12.3873 2.01684C12.1758 1.8053 11.8012 1.8053 11.5897 2.01684L10.6053 3.00119C10.312 2.84776 10.0068 2.72084 9.69233 2.62184V1.23076C9.69233 0.919374 9.43961 0.666656 9.12823 0.666656H6.87182C6.56043 0.666656 6.30771 0.919374 6.30771 1.23076V2.62184C5.99294 2.72084 5.68776 2.84748 5.39443 3.00119L4.41035 2.01712C4.19007 1.79684 3.83299 1.79684 3.61271 2.01712L2.01715 3.6124C1.91138 3.71817 1.85187 3.86173 1.85187 4.0115C1.85187 4.16099 1.9111 4.30455 2.01715 4.41032L3.00123 5.3944C2.84751 5.68802 2.72087 5.99348 2.62187 6.30796H1.23079C0.919405 6.30796 0.666687 6.56068 0.666687 6.87207V9.12848C0.666687 9.43986 0.919405 9.69258 1.23079 9.69258H2.62158C2.72087 10.0073 2.84751 10.3125 3.00123 10.6059L2.01687 11.5902C1.9111 11.696 1.85158 11.8396 1.85158 11.989C1.85158 12.1385 1.9111 12.2821 2.01687 12.3879L3.61243 13.9831C3.83271 14.2034 4.19007 14.2034 4.41007 13.9831L5.39443 12.9991C5.68776 13.1525 5.99294 13.2791 6.30743 13.3784V14.7692C6.30743 15.0806 6.56015 15.3333 6.87153 15.3333H9.12794C9.43933 15.3333 9.69205 15.0806 9.69205 14.7692V13.3779C10.0065 13.2786 10.3117 13.1519 10.605 12.9985L11.5897 13.9829C11.8012 14.1944 12.1758 14.1944 12.3873 13.9829L13.9826 12.3873C14.2029 12.167 14.2029 11.8099 13.9826 11.5897L12.9983 10.6053C13.1517 10.312 13.2783 10.0068 13.3776 9.6923H14.7693C15.0806 9.6923 15.3334 9.43958 15.3334 9.1282V6.87178C15.3334 6.5604 15.0806 6.30768 14.7693 6.30768ZM8.00002 11.3846C6.13369 11.3846 4.61541 9.86604 4.61541 7.99999C4.61541 6.13366 6.13369 4.61537 8.00002 4.61537C9.86635 4.61537 11.3846 6.13366 11.3846 7.99999C11.3846 9.86604 9.86607 11.3846 8.00002 11.3846Z"
                    />
                    <path
                      d="M8.00022 6.35876C7.09519 6.35876 6.35919 7.09497 6.35919 7.99979C6.35919 8.90461 7.0954 9.64082 8.00022 9.64082C8.90504 9.64082 9.64124 8.90461 9.64124 7.99979C9.64124 7.09497 8.90504 6.35876 8.00022 6.35876Z"
                    />
                  </svg>
                </q-icon>
                <q-item-label>Редактировать профиль</q-item-label>
              </q-item>

              <q-item clickable @click="exit">
                <q-icon size="16px">
                  <svg width="16" height="16" viewBox="0 0 16 16" id="exit">
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M0.666687 0.666656V7.99999V15.3333L6.30748 12.3651V3.63491L0.666687 0.666656ZM13.0529 6.0739C12.9001 6.08112 12.7672 6.17363 12.7169 6.30784C12.6665 6.44205 12.7088 6.59119 12.8238 6.68501L13.9754 7.65078H8.56379C8.3475 7.65078 8.18774 7.83537 8.18774 7.99999C8.18774 8.16461 8.36665 8.3492 8.56379 8.3492H13.9754L12.8238 9.30951C12.7234 9.39318 12.6789 9.52032 12.7071 9.64281C12.7353 9.7653 12.8319 9.86442 12.9604 9.90263C13.0888 9.94085 13.2295 9.91233 13.3291 9.82787L15.2093 8.25644C15.2883 8.19022 15.3334 8.09605 15.3334 7.99726C15.3334 7.89847 15.2883 7.8043 15.2093 7.73808L13.3291 6.16666C13.2544 6.10226 13.1547 6.06879 13.0529 6.0739Z"
                    />
                  </svg>
                </q-icon>
                <q-item-label>Выйти</q-item-label>
              </q-item>
            </q-list>
          </q-btn-dropdown>
        </q-item>
      </q-list>
    </q-header>

    <q-drawer v-model="left" show-if-above elevated class="q-drawer-main" :breakpoint="772" side="left">
      <q-list class="q-drawer-main-links">
        <q-item-label header>
        </q-item-label>
        <EssentialLink v-for="link in linksList" :key="link.title" v-bind="link" />
      </q-list>
    </q-drawer>

    <div class="absolute-bottom">
      <q-list>
        <q-item clickable :class="['menu-icon', { active: left }]" @click="left = !left">
          <q-item-section v-if="!left" avatar>
            <q-icon class="telegram" left size="24px">
              <svg width="24" height="24" viewBox="0 0 24 24">
                <g clip-path="url(#clip0)">
                  <rect x="1.58301" y="4" width="21.3333" height="3.69232" rx="1" fill="#596982" />
                  <rect x="1.58301" y="10.1543" width="21.3333" height="3.69232" rx="1" fill="#596982" />
                  <rect x="1.58301" y="16.3076" width="21.3333" height="3.69232" rx="1" fill="#596982" />
                </g>
                <defs>
                  <clipPath id="clip0">
                    <rect width="24" height="24" fill="white" transform="translate(0.25)" />
                  </clipPath>
                </defs>
              </svg>
            </q-icon>
          </q-item-section>

          <q-item-section v-else avatar>
            <q-icon class="telegram" left size="24px">
              <svg width="24" height="24" viewBox="0 0 24 24">
                <g clip-path="url(#clip0)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M19.7782 19.7784C19.0619 20.4946 17.9017 20.4946 17.1854 19.7784L12 14.5929L6.81455 19.7784C6.09831 20.4946 4.93807 20.4946 4.22182 19.7784C3.50558 19.0621 3.50559 17.9019 4.22183 17.1856L9.40728 12.0002L4.22183 6.81475C3.50559 6.09851 3.50559 4.93826 4.22183 4.22202C4.93807 3.50578 6.09831 3.50578 6.81455 4.22202L12 9.40747L17.1854 4.22202C17.901 3.50643 19.0619 3.50578 19.7782 4.22202C20.4944 4.93826 20.4938 6.09915 19.7782 6.81475L14.5927 12.0002L19.7782 17.1856C20.4944 17.9019 20.4944 19.0621 19.7782 19.7784Z"
                    fill="#4690ff"
                  />
                </g>
                <defs>
                  <clipPath id="clip0">
                    <rect width="24" height="24" fill="white" />
                  </clipPath>
                </defs>
              </svg>
            </q-icon>
          </q-item-section>

          <q-item-section>
            <div class="text">Меню</div>
          </q-item-section>
        </q-item>
      </q-list>
    </div>

    <q-page-container>
      <router-view />
    </q-page-container>
  </q-layout>
</template>

<script setup lang="ts">
import EssentialLink from 'components/EssentialLink.vue';
import { ref } from 'vue';
import { useRouter } from 'vue-router';
import { useAuth } from '@websanova/vue-auth';

/* eslint-disable */
const linksList = [
  {
    title: 'Статистика',
    icon: 'statistic',
    link: '/lk/statistics',
    name: 'Statistics',
  },
];
const auth = useAuth();
const router = useRouter();

const left = ref(false);

function exit() {
  auth.logout({
    makeRequest: true,
    redirect: { name: 'Login' },
  });
}
</script>
